## Import Dependencies

In [1]:
# Dependencies
from splinter import Browser
from splinter.exceptions import ElementDoesNotExist
from bs4 import BeautifulSoup as bs
import pandas as pd
import requests
from sqlalchemy import create_engine
from pprint import pprint

## Create path to website, initialize browser, scrape page

In [2]:
#launches a browser when headless = False
executable_path = {'executable_path': 'chromedriver.exe'}
browser = Browser('chrome', **executable_path, headless=False)

In [3]:
#sends my browser to this url
url_baaa = 'http://www.baaa-acro.com/statistics/death-number-per-operator'
browser.visit(url_baaa)

In [4]:
# HTML object
html_baaa = browser.html
    
# Parse HTML with Beautiful Soup
soup_baaa = bs(html_baaa, 'html.parser')
#soup_baaa

In [5]:
# Examine the results, then determine element that contains sought info
# print(soup_baaa.prettify())

## Grab data and assign to variables

In [6]:
rankings = []
operators = []
fatalitiesT = []

In [7]:
result_rank = soup_baaa.find_all('td', class_='views-field views-field-counter')
# result_rank

In [8]:
for rank in result_rank:
    ranking = rank.text
    rankings.append((ranking))
    
print(rankings)

['1        ', '2        ', '3        ', '4        ', '5        ', '6        ', '7        ', '8        ', '9        ', '10        ', '11        ', '12        ', '13        ', '14        ', '15        ', '16        ', '17        ', '18        ', '19        ', '20        ', '21        ', '22        ', '23        ', '24        ', '25        ', '26        ', '27        ', '28        ', '29        ', '30        ', '31        ', '32        ', '33        ', '34        ', '35        ', '36        ', '37        ', '38        ', '39        ', '40        ', '41        ', '42        ', '43        ', '44        ', '45        ', '46        ', '47        ', '48        ', '49        ', '50        ', '51        ', '52        ', '53        ', '54        ', '55        ', '56        ', '57        ', '58        ', '59        ', '60        ', '61        ', '62        ', '63        ', '64        ', '65        ', '66        ', '67        ', '68        ', '69        ', '70        ', '71        ', '72        ', '73        ', '74        ', '75        ', '76        ', '77        ', '78        ', '79        ', '80        ', '81        ', '82        ', '83        ', '84        ', '85        ', '86        ', '87        ', '88        ', '89        ', '90        ', '91        ', '92        ', '93        ', '94        ', '95        ', '96        ', '97        ', '98        ', '99        ', '100        ']

In [9]:
type(rankings)

list

## Convert data strings to series

In [10]:
rankingsS = pd.Series(rankings)
rankingsS

0       1
1       2
2       3
3       4
4       5
         ...
95     96
96     97
97     98
98     99
99    100
Length: 100, dtype: object

In [11]:
result_name = soup_baaa.find_all('td', class_='views-field views-field-name')

for name in result_name:
    operator = name.text
    operators.append((operator))
    
print(operators)

['Aeroflot - Russian International Airlines        ', 'United States Air Force - USAF (since 1947)        ', 'Royal Air Force - RAF        ', 'United States Army Air Forces - USAAF (1941-1947)        ', 'United States Navy - USN        ', 'Air France        ', 'Pan American World Airways - PAA        ', 'American Airlines        ', 'Soviet Air Force - Voyenno-vozdushnye sily CCCP        ', 'United Airlines        ', 'Royal Australian Air Force - RAAF        ', 'Avianca        ', 'Trans World Airlines - TWA        ', 'Private American        ', 'Turkish Airlines - THY Türk Hava Yollari        ', "French Air Force - Armée de l'Air        ", 'Indian Airlines        ', 'China Airlines        ', 'KLM Royal Dutch Airlines - Koninklijke Luchtvaart Maatschappij        ', 'Islamic Republic of Iran Air Force        ', 'Air India        ', 'Japan Airlines        ', 'Eastern Airlines        ', 'Brazilian Air Force - Força Aérea Brasileira        ', 'Pakistan International Airlines - PIA        ', 'Korean Air        ', 'German Air Force - Deutsche Luftwaffe        ', 'Indian Air Force - Bharatiya Vayu Sena        ', 'Cubana de Aviación        ', 'Malaysian Airlines System - MAS        ', 'Saudi Arabian Airlines - SAUDIA        ', 'Royal Canadian Air Force - RCAF        ', 'Northwest Airlines        ', 'Garuda Indonesian Airways        ', 'Iberia - Lineas Aéreas de Espana        ', 'CAAC - Civil Aviation Administration of China        ', 'British Overseas Airways Corporation - BOAC        ', 'Russian Air Force - Voyenno-vozdushnye sily Rossii        ', 'Iran Air        ', 'CSA Czech Airlines - Československé Státní Aerolinie        ', 'Indonesian Air Force - TNI-AU Tentara Nasional Indonesia - Angkatan Udara        ', 'British European Airways - BEA        ', 'Peruvian Air Force - Fuerza Aérea del Perú        ', 'Afghan Republican Air Force - Afghan Hanai Qurah        ', 'Egyptair        ', 'Ethiopian Airlines        ', 'Philippine Airlines - PAL        ', 'Royal Jordanian Airlines - ALIA        ', 'Alitalia - Linee Aeree Italiane        ', 'VASP - Viação Aérea de São Paulo        ', 'VARIG - Viação Aérea Rio Grandense        ', 'Nigeria Airways        ', 'LOT Polish Airlines - Polskie Linie Lotnicze        ', 'Lloyd Aéreo Boliviano - LAB Airlines        ', 'Air Vietnam        ', 'Linea Aeropostal Venezolana - LAV        ', 'Swissair        ', "SABENA - Société Anonyme Belge d'Exploitation de la Navigation Aérienne        ", 'Mexicana de Aviación        ', 'Argentinian Air Force - Fuerza Aérea Argentina        ', 'Deutsche Lufthansa        ', 'All Nippon Airways        ', 'Thai Airways International        ', 'Transportes Aéreos Mercantiles Ecuatorianos - TAME        ', 'Inex-Adria Airways        ', 'Faucett        ', 'Spanish Air Force - Ejército del Aire        ', 'South African Airways -SAA - Suid Afrikaanse Lugdiens - SAL        ', "Algerian Air Force - Al Quwwat Aljawwija Aljaza'Eriiya        ", 'Royal New Zealand Air Force - RNZAF        ', 'China National Aviation Corporation - CNAC        ', 'TAM Brasil - Taxi Aéreo Marilia - Transportes Aéreos Regionais        ', 'Colombian Air Force - Fuerza Aérea Colombiana        ', 'United Arab Airlines        ', 'Aerolineas Argentinas        ', 'Ariana Afghan Airlines        ', 'Merpati Nusantara Airlines - MNA        ', 'Balkan Bulgarian Airlines        ', 'SATENA - Servicio de Aeronavegacion a Territorios Nacionales        ', 'Delta Airlines        ', 'Panair do Brasil        ', 'French Navy        ', 'Angola Air Force - Força Aérea Nacional Angolana        ', 'Kenya Airways        ', 'Flying Tiger Line        ', 'Iran Air Tour        ', 'TAM Bolivia - Transporte Aéreo Militar Boliviano        ', 'TAROM - Transporturile Aeriene Romane        ', 'Dan-Air London        ', 'Libyan Arab Airlines        ', 'Philippine Air Force - Hukbong Himpapawid NG Pilipinas        ', 'Air New Zealand        ', 'Arrow Air        ', 'Gulf Air        ', 'SAM Colombia - Sociedad Aeronáutica de Medellín        ', 'Trans-Canada Air Lines - TCAL        ', 'Union des Transports Aériens - UTA        ', 'S7 Airlines        ', 'Canadian Pacific Airlines - CP Air        ', 'Hellenic Air Force - Elleniki Polemiki Aeroporia        ']

In [12]:
operatorsS = pd.Series(operators)
operatorsS

0     Aeroflot - Russian International Airlines
1     United States Air Force - USAF (since 1947)   ...
2                         Royal Air Force - RAF
3     United States Army Air Forces - USAAF (1941-19...
4                      United States Navy - USN
                            ...
95                Trans-Canada Air Lines - TCAL
96           Union des Transports Aériens - UTA
97                                  S7 Airlines
98           Canadian Pacific Airlines - CP Air
99    Hellenic Air Force - Elleniki Polemiki Aeropor...
Length: 100, dtype: object

In [13]:
result_fatalities = soup_baaa.find_all('td', class_='views-field views-field-field-final-total-fatalities')

for fatality in result_fatalities:
    total_fatalities = fatality.text
    fatalitiesT.append(total_fatalities)

print(fatalitiesT)

['11195        ', '8271        ', '7101        ', '6853        ', '4005        ', '1756        ', '1655        ', '1450        ', '1272        ', '1217        ', '1030        ', '992        ', '960        ', '900        ', '900        ', '898        ', '873        ', '857        ', '832        ', '829        ', '811        ', '770        ', '766        ', '756        ', '754        ', '728        ', '724        ', '722        ', '710        ', '671        ', '660        ', '646        ', '632        ', '615        ', '609        ', '608        ', '604        ', '569        ', '557        ', '550        ', '539        ', '538        ', '527        ', '517        ', '514        ', '495        ', '473        ', '463        ', '457        ', '442        ', '440        ', '433        ', '433        ', '432        ', '431        ', '430        ', '415        ', '414        ', '413        ', '405        ', '398        ', '387        ', '382        ', '378        ', '368        ', '366        ', '360        ', '360        ', '355        ', '354        ', '353        ', '350        ', '348        ', '346        ', '340        ', '334        ', '327        ', '322        ', '312        ', '307        ', '305        ', '303        ', '288        ', '283        ', '283        ', '278        ', '269        ', '266        ', '265        ', '265        ', '264        ', '261        ', '256        ', '255        ', '255        ', '254        ', '250        ', '249        ', '249        ', '249        ']

In [14]:
fatalitiesS = pd.Series(fatalitiesT)
fatalitiesS

0     11195
1      8271
2      7101
3      6853
4      4005
          ...
95      254
96      250
97      249
98      249
99      249
Length: 100, dtype: object

## Create Data frame from series, format data types

In [15]:
df = pd.DataFrame(data = dict(Ranking = rankingsS, Operator = operatorsS, Total_Fatalities = fatalitiesS), index = rankingsS.index)

In [16]:
df.head()

,Ranking,Operator,Total_Fatalities
0,1,Aeroflot - Russian International Airlines,11195
1,2,United States Air Force - USAF (since 1947) ...,8271
2,3,Royal Air Force - RAF,7101
3,4,United States Army Air Forces - USAAF (1941-19...,6853
4,5,United States Navy - USN,4005

In [17]:
df['Ranking'] = pd.to_numeric(df['Ranking'])
df['Total_Fatalities'] = pd.to_numeric(df['Total_Fatalities'])

In [18]:
df.dtypes

Ranking              int64
Operator            object
Total_Fatalities     int64
dtype: object

## New column with Military vs Non-Military designation

In [19]:
df['Military'] = ""

In [20]:
df = df[['Ranking', 'Total_Fatalities', 'Operator', 'Military']]

In [21]:
df.head()

,Ranking,Total_Fatalities,Operator,Military
0,1,11195,Aeroflot - Russian International Airlines,
1,2,8271,United States Air Force - USAF (since 1947) ...,
2,3,7101,Royal Air Force - RAF,
3,4,6853,United States Army Air Forces - USAAF (1941-19...,
4,5,4005,United States Navy - USN,

In [22]:
df.loc[df['Operator'].str.contains('Force'), 'Military'] = 'Military'
df.loc[df['Operator'].str.contains('Force') == False, 'Military'] = 'Non-Military'

In [23]:
df.loc[df['Operator'].str.contains('Navy'), 'Military'] = 'Military'

In [24]:
df.head(5)

,Ranking,Total_Fatalities,Operator,Military
0,1,11195,Aeroflot - Russian International Airlines,Non-Military
1,2,8271,United States Air Force - USAF (since 1947) ...,Military
2,3,7101,Royal Air Force - RAF,Military
3,4,6853,United States Army Air Forces - USAAF (1941-19...,Military
4,5,4005,United States Navy - USN,Military

In [25]:
browser.quit()

In [26]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/crash')

In [ ]:
engine.execute("DROP TABLE IF EXISTS crashes;")

In [ ]:
df.to_sql('crashes', engine)

In [ ]:
engine.execute('ALTER TABLE crashes ADD PRIMARY KEY (index);')

In [ ]:
df.to_json()

In [ ]:
pprint(df)